{
	"4138774728570944645-Maze.moveForward": "verb - imperative or infinitive for a person moving (walking) in the direction he/she is facing.",
	"6082253890512898845-Maze.turnLeft": "verb - imperative or infinitive for a person turning his head and body one quarter rotation counter-clockwise.  Prefer a translation that has text in common with the translation of 'turn right'.",
	"2801052495540198573-Maze.turnRight": "verb - imperative or infinitive for a person turning his head and body one quarter rotation clockwise.  Prefer a translation that has text in common with the translation of 'turn left'.",
	"4849628085259334999-Maze.do": "verb - imperative or infinitive preceding one or more commands to a person.",
	"8887050282173075109-Maze.else": "conjunction - 'otherwise', introducing commands to be performed if a previous condition was not true, as in 'if x>3, do this, else do that'.",
	"6564701009237559167-Maze.pathAhead": "condensed form of 'if there is a path ahead', as in: 'if path ahead, go forward'.",
	"4325555209360652695-Maze.pathLeft": "condensed form of 'if there is a path to the left', as in: 'if path left, turn left'.",
	"4688166460489035776-Maze.pathRight": "condensed form of 'if there is a path to the right', as in: 'if path right, turn right'.",
	"3570353873001116034-Maze.toTheLeft": "adverb - to modify the term for a path through a maze, as in: 'if path to the left, move backward'.",
	"1713718763430653774-Maze.toTheRight": "adverb - to modify the term for a path through a maze, as in: 'if path to the right, end game'.",
	"3760279214088835030-Maze.repeatUntilFinished": "verb - imperative or infinitive to repeat the following commands until the program is finished (the end of a maze has been reached).",
	"361674041946510135-Maze.moveForwardTooltip": "tooltip (pop-up help) - Pegman is the humanoid icon used in Google Maps.  See picture at http://goo.gl/9I64i (http://maps.google.com/intl/en/help/maps/streetview/learn/pegman.html).  The term 'space' refers to a single square within a maze.",
	"826514418572436974-Maze.turnTooltip": "tooltip (pop-up help) - Pegman is the humanoid icon used in Google Maps.  See picture at http://goo.gl/9I64i (http://maps.google.com/intl/en/help/maps/streetview/learn/pegman.html). The term 'space' refers to a single square within a maze.",
	"412027119640112732-Maze.ifTooltip": "tooltip (pop-up help) - 'path' refers to a path through a maze. ",
	"6175401358049603739-Maze.ifelseTooltip": "tooltip (pop-up help) - 'path' refers to a path through a maze.",
	"1190064103412776740-Maze.whileTooltip": "tooltip (pop-up help) - Repeat the enclosed commands until the maze has been successfully completed (the end point reached).",
	"1923697266356637829-Maze.capacity0": "warning - No more blocks may be added until some are removed.  Do not alter the portion between pointy brackets (< and >), although you may move it within the phrase.",
	"1740099458630159531-Maze.capacity1": "warning - Only one more block may be added.  Do not alter the portion between pointy brackets (< and >), although you may move it within the phrase.",
	"8194173010046025493-Maze.capacity2": "warning - Only %1 more blocks may be used, where %1 is an integer greater than 1.  Do not alter the portion between pointy brackets (< and >), although you may move it within the phrase.",
	"7358214333593766572-Maze.nextLevel": "alert - This is displayed when the user solves the maze, inviting them to precede to the next level of difficulty.  %1 is an integer greater than 1.",
	"7149849676690329496-Maze.finalLevel": "alert - This is displayed when the user solves the most difficult level.",
	"4051416073809352347-Maze.oneTopBlock": "alert - This is displayed if a user attempts to run a program composed of multiple stacks of blocks, letting them know they need to create a single stack.",
	"6397605502009184614-Maze.fullTitle": "title - This is the title of the maze tutorial web page.  Do not translate 'Blockly', but do transliterate (show how to pronounce) it, if it would be unclear to a speaker of your language. For example, the Russian translation includes 'Blockly (Блoкли)'.",
	"2370415430586059806-Maze.title": "noun - This word appears on a link to direct users to this maze tutorial.",
	"3799760460110153809-Maze.level": "noun - This refers to the level in a game and will be followed by a number, as in 'Level 1' (the beginning level) or 'Level 10' (the final level).",
	"3542684864087093156-Maze.instructions1": "instructions - the word 'program' refers to a computer program, and thewords for 'stack' and 'blocks' should be the same as for stacking children's blocks. Use the imperative verb form appropriate for speaking to a child, gender unspecified.  If no gender-neutral singular/familiar form exists but a gender-neutral plural/formal form exists, use that instead.",
	"3107464560858837706-Maze.instructions2": "instructions - the word 'steps' refers to instructions in a computer program; 'path' refers to the path through a maze.  See previous description for tense.",
	"4117834464422802314-Maze.instructions3": "instructions - 'path' refers to a path through a maze, and 'block' refers to a child's building block.",
	"7924052971858977034-Maze.instructions4": "instructions - the goal is reaching the end point in a maze; 'block' refers to a child's building block.",
	"5504218682327601531-Maze.instructions5": "instructions - 'turn left' refers to rotating in place a quarter circle counter-clockwise.",
	"7837544939813721855-Maze.instructions6": "instructions - an example of an 'if' block is: 'if there is a path to the left, turn left'.",
	"4142991828936593951-Maze.instructions7": "instructions displayed along with a new maze for the user to solve.",
	"8369157115089930453-Maze.instructions8": "instructions - 'block' refers to a child's building block.",
	"7801554455370029732-Maze.instructions9": "instructions - 'block' refers to a child's building block.  For 'if-else' concatenate the words for 'if' and 'else/otherwise'.",
	"4572857545803877392-Maze.instructions10": "instructions - This advises the user to solve a maze by keeping his/her left hand in contact with the wall while proceding through it.  The final sentence is a warning that only advanced programmers should attempt this problem, as beginners tend to get frustrated.",
	"5729392237036335843-Maze.codeTooltip": "tooltip (pop-up help) for button; pressing the button causes a program in the JavaScript computer language to be displayed, based on the program created by the user.",
	"2194902007208446636-Maze.linkTooltip": "tooltip (pop-up help) for button; pressing the button causes the user's program to be saved and for a URL to be provided for retrieving it.  The word 'blocks' is as in children's toy blocks.",
	"4569563074235560111-Maze.randomizeMarkerTooltip": "tooltip (pop-up help) for button; pressing the button causes the start marker and finish markers in the current maze to be moved to random locations, without othwerise changing the maze.",
	"8195626643865709645-Maze.runProgram": "button label - Pressing the button runs the computer program the user has written.",
	"8086403647682698529-Maze.resetProgram": "button label - Pressing the button causes Pegman return to the start of the maze (but does not delete the user's program.)",

}
